'''Є певний текст. Реалізуйте таку функціональність:
    змінити текст таким чином, щоб кожне речення починалося з великої літери;
    порахуйте скільки разів цифри зустрічаються в тексті;
    порахуйте скільки разів розділові знаки зустрічаються в тексті;
    порахуйте кількість знаків оклику в тексті.'''
import re
txt = input('Введіть текст: ')
txt_sp = re.split(r'(?<=\.|\?|\!)\s', txt)
res = ''
for t in txt_sp:
    txt_sp = str(t.capitalize())
    res += f'{txt_sp} '
print(res)

digit = 0
znak = 0
for i in txt:
    if i.isdigit():
        digit +=1
    elif not i.isalnum():
        znak += 1
    else:
        pass

okluk = txt.count('!')
print(f'Кількість цифр в тексті: {digit}')
print(f'Кількість розділових знаків в тексті: {znak}')
print(f'Кількість знаків оклику в тексті: {okluk}')
