'''Напишіть функцію, яка перевіряє, чи є шестизначне число "щасливим".
Число передається як параметр. Якщо число щасливе потрібно повернути з функції true, якщо ні — false.

Щасливе шестизначне число — це число, у якого сума перших трьох цифр дорівнює сумі трьох інших цифр.
Наприклад, 123420 — щасливе, бо 1+2+3 = 4+2+0, а 723422 — нещасливе, тому що 7+2+3 != 4+2+2.'''

def Lucky(x):
    x = str(x)
    idx = len(x) // 2
    x1 = x[0:idx]
    x2 = x[idx:len(x)]
    n1 = 0
    n2 = 0
    for i in x1:
        n1 += int(i)
    for i in x2:
        n2 += int(i)
    if n1 == n2:
        return True
    else:
        return False

print(Lucky(123024))
